
import { Comment } from "../types";

export const comments: Comment[] = [
  {
    id: "1",
    eventId: "1",
    author: "Историк",
    text: "Куликовская битва положила начало освобождению русских земель от ордынской зависимости.",
    date: "2025-02-15"
  },
  {
    id: "2",
    eventId: "1",
    author: "Студент",
    text: "Интересно было бы узнать больше о тактике, применявшейся Дмитрием Донским в этом сражении.",
    date: "2025-03-20"
  },
  {
    id: "3",
    eventId: "2",
    author: "Любитель истории",
    text: "Отечественная война 1812 года стала настоящим испытанием для Российской империи, но народ проявил удивительную стойкость и патриотизм.",
    date: "2025-01-10"
  },
  {
    id: "4",
    eventId: "4",
    author: "Ветеран",
    text: "Мой дед участвовал в обороне Сталинграда. Невозможно переоценить подвиг тех, кто сражался за нашу Родину.",
    date: "2025-04-01"
  }
];
